Revit 2027 API
Camera.NearDistance Property
 Distance to near clipping plane
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double NearDistance { get; set; }
Public Property NearDistance As Double
	Get
	Set
public:
property double NearDistance {
	double get ();
	void set (double value);
}
member NearDistance : float with get, set
Property Value
Double
See Also
Reference
Camera Class
Autodesk.Revit.DB.DirectContext3D Namespace